public/projects/website/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Index</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content" class="content">

<div id="outline-container-org2099e5c" class="outline-2">
<h2 id="org2099e5c">Introduction</h2>
<div class="outline-text-2" id="text-org2099e5c">
<p>
I wanted to document the process of building this website. I didn't just sit down and start writing raw HTML. Do people even do that any more?
</p>

<p>
When I work on projects, I already prefer to write up the code, document, or Jupyter notebook as if I am telling a story. This helps me better understand that concepts I am covering, makes me write more clearly and explain to myself what I did when I inevitably revisit a notebook. If that's how I write, why not try to turn all of that into a personal website, project portfolio, and learning space for web development skills?
</p>

<p>
My goal was to take the stuff I was already doing and turn it into a website, and thankfully, that isn't too difficult!
</p>
</div>
</div>

<div id="outline-container-org18a986f" class="outline-2">
<h2 id="org18a986f">Developing This Website</h2>
<div class="outline-text-2" id="text-org18a986f">
<p>
I'm building this website slowly and incrementally making changes to it in balance with wanting to work on other projects. I still want to document those incremental changes (when the increment or sum of smaller increments warrants it) here.
</p>

<ol class="org-ol">
<li><a href="./initial_build.html">Starting the initial build using Emacs and Org Mode to publish</a></li>
<li><a href="./hosting_on_github.html">Hosting the initial build on GitHub Pages</a></li>
<li><a href="./subdirectory_index.html">Dealing with Subdirectory Index Pages</a></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.0.50 (<a href="https://orgmode.org">Org</a> mode 9.6.8)</p>
</div>
</body>
</html>